app/models/user.rb

  def password=(password)
    @password = password
    self.password_digest = BCrypt::Password.create(password)
    self.save
---
INSERT INTO "users" ("email", "password_digest", "session_token", "created_at", "updated_at", "name") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def reset_session_token!
    self.session_token = generate_session_token
    self.save
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "6RWQTP0glqPvRNeFwxPa1g"], ["updated_at", "2021-05-13 00:17:03.408487"], ["id", 14]]